In [ ]:
import pandas as pd

In [ ]:
a = [1,4,2,6,8,3,9]
type(a)

list

In [ ]:
a

[1, 4, 2, 6, 8, 3, 9]

In [ ]:
a = pd.Series(a)
type(a)
a

0    1
1    4
2    2
3    6
4    8
5    3
6    9
dtype: int64

In [ ]:
a.min()

1

In [ ]:
a.max()

9

In [ ]:
range = a.max() - a.min()
range
type(range)

int

In [ ]:
a.sort_values()

0    1
2    2
5    3
1    4
3    6
4    8
6    9
dtype: int64

In [ ]:
a.sort_values(ascending=False)

6    9
4    8
3    6
1    4
5    3
2    2
0    1
dtype: int64

In [ ]:
a.sort_values(ascending=False, inplace = True)

In [ ]:
a

6    9
4    8
3    6
1    4
5    3
2    2
0    1
dtype: int64

In [ ]:
a[4:]

5    3
2    2
0    1
dtype: int64

In [ ]:
for i in a:
  print(i)

9
8
6
4
3
2
1

In [ ]:
a[4]

8

Lecture 2: **[Data Frames Intro](https://colab.research.google.com/drive/13SvDUNWu7SfZXS9ueNpc2vSwzpiVNvvB)**

In [ ]:
import pandas as pd

In [ ]:
filename = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/titanic.csv"
data_frame = pd.read_csv(filename)
data_frame.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [ ]:
data_frame.head(10)

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
5       1                              Anderson, Mr. Harry  ...        S         1
6       1                Andrews, Miss. Kornelia Theodosia  ...        S         1
7       1                           Andrews, Mr. Thomas Jr  ...        S         0
8       1    Appleton, Mrs. Edward Dale (Charlotte Lamson)  ...        S         1
9       1                          Artagaveytia, Mr. Ramon  ...        C         0

[10 rows x 11 columns]

In [ ]:
data_frame.to_csv("my_titanic.csv")

In [ ]:
data_frame.to_excel("my_titatic.xlsx")

In [ ]:
data_frame.describe()

            pclass          age  ...         fare     survived
count  1309.000000  1046.000000  ...  1308.000000  1309.000000
mean      2.294882    29.881135  ...    33.295479     0.381971
std       0.837836    14.413500  ...    51.758668     0.486055
min       1.000000     0.166700  ...     0.000000     0.000000
25%       2.000000    21.000000  ...     7.895800     0.000000
50%       3.000000    28.000000  ...    14.454200     0.000000
75%       3.000000    39.000000  ...    31.275000     1.000000
max       3.000000    80.000000  ...   512.329200     1.000000

[8 rows x 6 columns]

In [ ]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
pclass      1309 non-null int64
name        1309 non-null object
sex         1309 non-null object
age         1046 non-null float64
sibsp       1309 non-null int64
parch       1309 non-null int64
ticket      1309 non-null object
fare        1308 non-null float64
cabin       295 non-null object
embarked    1307 non-null object
survived    1309 non-null int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

Creating DataFrames from non csv sources

In [ ]:
# Create a list
list_a = ['a','b','c']
list_a

['a', 'b', 'c']

In [ ]:
df_a = pd.DataFrame(list_a)
df_a

   0
0  a
1  b
2  c

Converting Dictionaries to DataFrames

In [ ]:
dict_a = {
    'http_status' : [200, 404,3000,500, 301],
    'response_time' : [0.04, 0.05, 0.01, 0.03, 0.02]
}
dict_df = pd.DataFrame(dict_a)
dict_df

   http_status  response_time
0          200           0.04
1          404           0.05
2         3000           0.01
3          500           0.03
4          301           0.02

Working back on titanic dataset

In [ ]:
data_frame.tail()

      pclass                       name     sex  ...  cabin  embarked  survived
1304       3       Zabour, Miss. Hileni  female  ...    NaN         C         0
1305       3      Zabour, Miss. Thamine  female  ...    NaN         C         0
1306       3  Zakarian, Mr. Mapriededer    male  ...    NaN         C         0
1307       3        Zakarian, Mr. Ortin    male  ...    NaN         C         0
1308       3         Zimmerman, Mr. Leo    male  ...    NaN         S         0

[5 rows x 11 columns]

In [ ]:
data_frame.columns

Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'survived'],
      dtype='object')

In [ ]:
data_frame['name']

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [ ]:
data_frame.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [ ]:
data_frame.loc[0,'name'] # accessing a particular record, (index,column_name)

'Allen, Miss. Elisabeth Walton'

In [ ]:
data_frame.loc[:,'name']

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [ ]:
# getting all columns of a particular row
data_frame.loc[0,:] # 0th index means info about row one

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                    29
sibsp                                   0
parch                                   0
ticket                              24160
fare                              211.338
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

In [ ]:
data_frame.iloc[2] # using iloc method and calling info about 3rd row

pclass                                 1
name        Allison, Miss. Helen Loraine
sex                               female
age                                    2
sibsp                                  1
parch                                  2
ticket                            113781
fare                              151.55
cabin                            C22 C26
embarked                               S
survived                               0
Name: 2, dtype: object

In [ ]:
data_frame.loc[:,['name','sex']] # slicing multiple columns

                                                 name     sex
0                       Allen, Miss. Elisabeth Walton  female
1                      Allison, Master. Hudson Trevor    male
2                        Allison, Miss. Helen Loraine  female
3                Allison, Mr. Hudson Joshua Creighton    male
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...                                               ...     ...
1304                             Zabour, Miss. Hileni  female
1305                            Zabour, Miss. Thamine  female
1306                        Zakarian, Mr. Mapriededer    male
1307                              Zakarian, Mr. Ortin    male
1308                               Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

NOTE: A 1-Dimensional pandas object is a series, and a 2-Dimensional ppandas object is a DataFrame

In [ ]:
data_frame[['name', 'sex']]

                                                 name     sex
0                       Allen, Miss. Elisabeth Walton  female
1                      Allison, Master. Hudson Trevor    male
2                        Allison, Miss. Helen Loraine  female
3                Allison, Mr. Hudson Joshua Creighton    male
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...                                               ...     ...
1304                             Zabour, Miss. Hileni  female
1305                            Zabour, Miss. Thamine  female
1306                        Zakarian, Mr. Mapriededer    male
1307                              Zakarian, Mr. Ortin    male
1308                               Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

In [ ]:
data_frame['sex'].describe()

count     1309
unique       2
top       male
freq       843
Name: sex, dtype: object

In [ ]:
data_frame['pclass'].unique()

array([1, 2, 3])

In [ ]:
data_frame[['fare', 'age']].mean()

fare    33.295479
age     29.881135
dtype: float64

In [ ]:
data_frame[['fare','age']].mean(axis=1)

0       120.16875
1        76.23335
2        76.77500
3        90.77500
4        88.27500
          ...
1304     14.47710
1305     14.45420
1306     16.86250
1307     17.11250
1308     18.43750
Length: 1309, dtype: float64

In [ ]:
data_frame.mean(numeric_only=True) # mean of all numeric values present in the table

pclass       2.294882
age         29.881135
sibsp        0.498854
parch        0.385027
fare        33.295479
survived     0.381971
dtype: float64

In [ ]:
data_frame.mean()   # no need to mention the above argument as this code returns the same output

pclass       2.294882
age         29.881135
sibsp        0.498854
parch        0.385027
fare        33.295479
survived     0.381971
dtype: float64

# Filtering using Boolean Operations

In [ ]:
data_frame['pclass'] == 1

0        True
1        True
2        True
3        True
4        True
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: pclass, Length: 1309, dtype: bool

In [ ]:
data_frame[data_frame['pclass'] == 1]

     pclass                                             name  ... embarked  survived
0         1                    Allen, Miss. Elisabeth Walton  ...        S         1
1         1                   Allison, Master. Hudson Trevor  ...        S         1
2         1                     Allison, Miss. Helen Loraine  ...        S         0
3         1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4         1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
..      ...                                              ...  ...      ...       ...
318       1           Williams-Lambert, Mr. Fletcher Fellows  ...        S         0
319       1                        Wilson, Miss. Helen Alice  ...        C         1
320       1                                Woolner, Mr. Hugh  ...        S         1
321       1                               Wright, Mr. George  ...        S         0
322       1                         Young, Miss. Marie Grice  ...        C         1

[323 rows x 11 columns]

In [ ]:
data_frame[data_frame['age'] > 70]

      pclass  ... survived
9          1  ...        0
14         1  ...        1
61         1  ...        1
135        1  ...        0
727        3  ...        0
1235       3  ...        0

[6 rows x 11 columns]

In [ ]:
data_frame.isnull()

      pclass   name    sex    age  ...   fare  cabin  embarked  survived
0      False  False  False  False  ...  False  False     False     False
1      False  False  False  False  ...  False  False     False     False
2      False  False  False  False  ...  False  False     False     False
3      False  False  False  False  ...  False  False     False     False
4      False  False  False  False  ...  False  False     False     False
...      ...    ...    ...    ...  ...    ...    ...       ...       ...
1304   False  False  False  False  ...  False   True     False     False
1305   False  False  False   True  ...  False   True     False     False
1306   False  False  False  False  ...  False   True     False     False
1307   False  False  False  False  ...  False   True     False     False
1308   False  False  False  False  ...  False   True     False     False

[1309 rows x 11 columns]

In [ ]:
data_frame['cabin'].isnull() # isnull method

0       False
1       False
2       False
3       False
4       False
        ...
1304     True
1305     True
1306     True
1307     True
1308     True
Name: cabin, Length: 1309, dtype: bool

In [ ]:
data_frame[data_frame['cabin'].notnull()] # Not null method with sub indexing

      pclass  ... survived
0          1  ...        1
1          1  ...        1
2          1  ...        0
3          1  ...        0
4          1  ...        0
...      ...  ...      ...
1189       3  ...        1
1217       3  ...        0
1230       3  ...        0
1231       3  ...        0
1249       3  ...        0

[295 rows x 11 columns]

# [Data Cleaning ](https://colab.research.google.com/drive/1-VFEs6NqLDJNfNH77j-MU079O_hiJa6b)